app/controllers/users_controller.rb

  def update
    @user=User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "123456"], ["updated_at", "2019-12-19 17:28:34.284412"], ["id", 1]]

  def create
    # @user = User.new(user_name: params[:user_name], email: params[:email], password: params[:password])
    @user= User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("user_name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_name", "abdi"], ["email", "abdi@gmail.com"], ["password", "123456"], ["created_at", "2019-12-19 17:50:14.584205"], ["updated_at", "2019-12-19 17:50:14.584205"]]